from openpecha.proofreading import get_page
from pathlib import Path

def test_get_page():
    pecha_id = "P0003"
    vol_num = 1
    page_id = "6796e040db684bc09365121dd248acd1"
    pecha_path = './tests/data/proofreading/P0003/'
    page_info = get_page(pecha_id, vol_num, page_id, pecha_path)
    expected_page_info = {
        'content': """༄༅༅། །རྒྱ་གར་སྐད་དུ། ཨཱརྱ་པྲཛྙཱ་པཱ་ར་མི་ཏཱ་སཉྩ་ཡ་གཱ་ཐཱ། བོད་སྐད་དུ། འཕགས་པ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་སྡུད་པ་ཚིགས་སུ་བཅད་པ། འཕགས་པ་
འཇམ་དཔལ་ལ་ཕྱག་འཚལ་ལོ། །དེ་ནས་ཡང་བཅོམ་ལྡན་འདས་ཀྱིས་འཁོར་བཞི་པོ་དེ་དག་ཡང་དག་པར་རབ་ཏུ་དགའ་བར་མཛད་པའི་ཕྱིར་ཡང་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་འདི་སྟོན་
ཅིང་། དེའི་ཚེ་ཚིགས་སུ་བཅད་པ་འདི་དག་བཀའ་སྩལ་ཏོ། །དགའ་དང་གུས་དང་དད་པའི་མཆོག་ནི་ཉེར་བཞག་སྟེ། །སྒྲིབ་པ་ཉོན་མོངས་བསལ་ནས་དྲི་མ་ལས་འདས་པ། །འགྲོ་དོན་
མངོན་ཞུགས་དེས་པའི་ཤེས་རབ་ཕ་རོལ་ཕྱིན། །གང་ལ་དཔའ་རྣམས་སྤྱོད་པ་དེ་ནི་མཉན་པར་གྱིས། །སྐབས་དང་པོ་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་བསྟན། འཛམ་བུའི་གླིང་འདིར་ཆུ་ཀླུང་ཇི་
སྙེད་ཅིག་འབབ་ཅིང་། །མེ་ཏོག་འབྲས་ལྡན་སྨན་དང་ནགས་ཚལ་སྐྱེད་བྱེད་པ། །མ་དྲོས་གནས་པའི་ཀླུ་དབང་ཀླུ་བདག་བརྟེན་གནས་ཏེ། །དེ་ནི་ཀླུ་ཡི་བདག་པོ་དེ་ཡི་མཐུ་དཔལ་ཡིན། །""",
        'image_url': 'https://iiif.bdrc.io/bdr:I0919::09190004.tif/full/max/0/default.jpg'
    }
    assert expected_page_info == page_info
